[
  "obsidian-excalidraw-plugin",
  "calendar",
  "dataview",
  "i18n",
  "pkmer",
  "homepage",
  "obsidian-activity-history",
  "calendar-beta",
  "obsidian-memos",
  "cm-editor-syntax-highlight-obsidian",
  "editing-toolbar",
  "obsidian-markmind",
  "easy-typing-obsidian",
  "vscode-editor",
  "open-in-new-tab",
  "obsidian-vimrc-support"
]