[
  "obsidian-excalidraw-plugin",
  "calendar",
  "dataview",
  "homepage",
  "obsidian-activity-history",
  "calendar-beta",
  "cm-editor-syntax-highlight-obsidian",
  "editing-toolbar",
  "obsidian-markmind",
  "vscode-editor",
  "copilot",
  "obsidian-style-settings",
  "templater-obsidian",
  "obsidian-custom-file-extensions-plugin",
  "pkmer",
  "i18n"
]