[
  "obsidian-excalidraw-plugin",
  "calendar",
  "dataview",
  "i18n",
  "homepage",
  "obsidian-activity-history",
  "calendar-beta",
  "cm-editor-syntax-highlight-obsidian",
  "editing-toolbar",
  "obsidian-markmind",
  "vscode-editor",
  "open-in-new-tab",
  "obsidian-vimrc-support",
  "copilot",
  "obsidian-style-settings",
  "templater-obsidian",
  "obsidian-banners",
  "obsidian-custom-file-extensions-plugin",
  "Enhanced-editing",
  "obsidian-kanban"
]