
#doing



## 今日目标
- [ ] 测试 AXI-DMA Lowpower 模式 [completion:: 2024-11-23]
	- 之前有问题的 bit 是在 comtest 中配置了 `0xfa49008c == 1` 之后就只能完成一次 dma 传输 
	- 结果：先使能 dma 后配置 `0xfa49008c=0x1` 正常工作；先配置 `0xfa49008c=0x1` 再使能 `dma` 无法完成
- [ ] 配置 Obsidian                                                                                                                                                                                                                                                                                                                                                                                                                                
- [ ] 熟悉 AXI-DMA Linux Driver，如果已经足够熟悉，使用 Gen_SPI 对接 DMA
- [ ] `ZB25VQ32B` 掉电测试写保护区域也会被破坏
	-  目前用 develop 分支的测试代码复现不了问题
	- 需要将测试代码移到 1.8.8-1 分支 
- [ ] 周小结


## 实施过程

### 测试 AXI-DMA Lowpower 模式：

- 老的 bit：`390486: [flash_x8_clkgate_dma_FPGA_2024-11-15.tar] 测试axi_dma，clkgate模块有效   
	  - 复现步骤:
		```shell
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0   
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0  
		memcpy block.  
		
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0   
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0  
		memcpy block.  
		
		!!!!!!  set*fa49008c = 0x1 !!!!!!	  
		
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0   
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0  
		```
- 新的 bit：`390486:dmac_1_FPGA_2024-11-22.tar`   
	 - 测试步骤：
		```shell
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0                                                                                               
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0    
		memcpy block.    
		
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0     
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0    
		memcpy block.    
		
		!!!!!!  set*fa49008c = 0x1 !!!!!!	    
		
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0     
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0    
		memcpy block.    
		
		boot> dma m2m 0x200000 0x300000 0x100 0 0 0     
		src addr : 0x200000, dest addr : 0x300000, len : 0 KB, channel: 0    
		memcpy block.    
		
		boot> dma lowpower 0    
		boot> dma lowpower 0    
		boot> dma lowpower 1    
		boot> dma lowpower 1    
		boot> dma lowpower 0    
		```
	    - 其它测试：
		  - 由于 dma clkgate 不能动态修改，所以在 gdb 加载完程序之后配置好 clkgate，分别测试 comtest、Lowpower 两个测试用例
			- [x]  clkgate = 0、comtest    
			  - [ ]  clkgate = 1、comtest    
				有问题 
			- [x]  clkgate = 0、lowpower    
			- [x]  clkgate = 1、lowpoer    
		  - 测试结果：fail
	  - 新的 bit 测试：
		- 如果先使能了 DMA 控制器，再配置 `0xfa49008c` 能够正常传输完成
		- 如果先配置 `0xfa49008c=0x1` 再使能 DMA 控制器，第一次传输就无法完成 
		- 如果不配置 `0xfa49008c` 的话就没关系 


### ZB 写保护区域掉电被破坏

- 使用 develop 分支的代码进行写保护掉电测试 40000 次没出问题
	- 客户反馈说是 `v1.9.8-8.1`  分支测的有问题，`v3.0.1`  分支测试没问题
- 移植掉电测试程序到 `v1.9.8-8.1` 分支进行测试 




## 反思



## 其它 
- 16:13 
	测试 axi-dma 的步骤：
	1. 开 dma 之前配置 `0xfa49008c=0x1` 成功
	2. 配置 `0xfa49008c=0x1` 之后再开 dma 失败 